import math


def dot_product(vec1, vec2):
    """
    Скалярний добуток використовується в математиці, фізиці та машинному навчанні
    для обчислення кутів між векторами, проекцій тощо.

    Параметри:
    - vec1: перший вектор (список чисел)
    - vec2: другий вектор (список чисел)

    Повертає:
    - Скалярний добуток (число)
    """
    return sum(a * b for a, b in zip(vec1, vec2))


def vector_subtract(vec1, vec2):
    """
    Віднімання векторів використовується в лінійній
    алгебрі для знаходження різниці між векторами.

    Параметри:
    - vec1: перший вектор (список чисел)
    - vec2: другий вектор (список чисел)

    Повертає:
    - Новий вектор, що є результатом віднімання (список чисел)
    """
    return [a - b for a, b in zip(vec1, vec2)]


def vector_add(vec1, vec2):
    """
    Додавання векторів використовується в лінійній алгебрі для знаходження суми векторів.

    Параметри:
    - vec1: перший вектор (список чисел)
    - vec2: другий вектор (список чисел)

    Повертає:
    - Новий вектор, що є результатом додавання (список чисел)
    """
    return [a + b for a, b in zip(vec1, vec2)]


def vector_multiply(vec, scalar):
    """
    Множення вектора на скаляр використовується для масштабування вектора.

    Параметри:
    - vec: вектор (список чисел)
    - scalar: скаляр (число)

    Повертає:
    - Новий вектор, що є результатом множення (список чисел)
    """
    return [a * scalar for a in vec]


def vector_norm(vec):
    """
   Евклідова норма використовується для визначення довжини вектора.

    Параметри:
    - vec: вектор (список чисел)

    Повертає:
    - Норма вектора (число)
    """
    return math.sqrt(sum(a ** 2 for a in vec))


def vector_mean(vectors):
    """
     Середнє значення векторів використовується для знаходження центру мас або середнього значення набору даних.

    Параметри:
    - vectors: список векторів (список списків чисел)

    Повертає:
    - Вектор, що є середнім значенням (список чисел)
    """
    n = len(vectors)
    return [sum(vec[i] for vec in vectors) / n for i in range(len(vectors[0]))]
